Тест/Тест/src/Documents/ПриходДенегНаСчет/ПриходДенегНаСчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриходДенегНаСчет</name>
  <basedOn>Document.ЗаказНаряд</basedOn>
  <basedOn>Document.ЗаказНаДоставку</basedOn>
  <basedOn>Document.ПродажаЗапчастей</basedOn>
  <registerRecords>AccumulationRegister.РасчетыСПоставщиками</registerRecords>
  <registerRecords>AccumulationRegister.ОплатыПоСделкам</registerRecords>
  <registerRecords>AccumulationRegister.Баланс</registerRecords>
  <registerRecords>AccumulationRegister.БаланПоНакладной</registerRecords>
  <registerRecords>AccumulationRegister.БалансКлиента</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщаяСумма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Счет</name>
    <type>
      <types>CatalogRef.Счета</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийПоступлениеДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>Сделка</name>
    <type>
      <types>DocumentRef.ПродажаЗапчастей</types>
      <types>DocumentRef.ЗаказНаДоставку</types>
      <types>DocumentRef.ЗаказНаряд</types>
      <types>DocumentRef.ПрочиеДоходы</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.ПроектыРазработки</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Поступление</name>
    <type>
      <types>EnumRef.ВидыПоступлений</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </attributes>
  <attributes>
    <name>Отдел</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </attributes>
  <attributes>
    <name>Статья</name>
    <type>
      <types>CatalogRef.ВидыРасходов_3</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПрихода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть1</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.ПродажаЗапчастей</types>
        <types>DocumentRef.ЗаказНаДоставку</types>
        <types>DocumentRef.ЗаказНаряд</types>
      </type>
    </attributes>
    <attributes>
      <name>Счет</name>
      <type>
        <types>CatalogRef.Счета</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тест/Тест/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>ФИО</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФиксированаяЧастьЗарплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Аванс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьВПланировании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиСогласования</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тест/Тест/src/CommonForms/СегментацияКлиентовПоМенеджерам/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьПараметрыСписокСегментацияКлиентовПоМенеджерам();
	РассчитатьИтогиСписокСегментацияКлиентовПоМенеджерам();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Фильтр = 1;
КонецПроцедуры

#Область СлужебныеПроцедурыИФункции
Процедура ЗаполнитьПараметрыСписокСегментацияКлиентовПоМенеджерам()
	// Комлев АА 02/11/24 +++
	СписокСегментацияКлиентовПоМенеджерам.Параметры.УстановитьЗначениеПараметра("ОбщийКлиент",
		Справочники.Пользователи.НайтиПоНаименованию("Общий Клиент"));

	ДатаВПрошлом  = НачалоДня(ТекущаяДата() - (24 * 60 * 60) * 10);
	СписокСегментацияКлиентовПоМенеджерам.Параметры.УстановитьЗначениеПараметра("ДатаНачала", ДатаВПрошлом);
	СписокСегментацияКлиентовПоМенеджерам.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", КонецДня(
		ТекущаяДата()));

	ДатаНачалаАКБ = НачалоДня(Дата(ТекущаяДата()) - (24 * 60 * 60) * 30);
	ДатаОкончанияАКБ = КонецДня(Дата(ТекущаяДата()));
	СписокСегментацияКлиентовПоМенеджерам.Параметры.УстановитьЗначениеПараметра("ДатаНачалаАКБ", ДатаНачалаАКБ);
	СписокСегментацияКлиентовПоМенеджерам.Параметры.УстановитьЗначениеПараметра("ДатаОкончанияАКБ", ДатаОкончанияАКБ);

	ДатаНачалаТеплые = НачалоДня(Дата(ТекущаяДата()) - (24 * 60 * 60) * 90);
	ДатаОкончанияТеплые = КонецДня(Дата(ТекущаяДата()) - (24 * 60 * 60) * 31);
	СписокСегментацияКлиентовПоМенеджерам.Параметры.УстановитьЗначениеПараметра("ДатаНачалаТеплые", ДатаНачалаТеплые);
	СписокСегментацияКлиентовПоМенеджерам.Параметры.УстановитьЗначениеПараметра("ДатаОкончанияТеплые",
		ДатаОкончанияТеплые);

	ДатаНачалаПотенциальные = НачалоДня(Дата(ТекущаяДата()) - (24 * 60 * 60) * 90);
	ДатаОкончанияПотенциальные = КонецДня(Дата(ТекущаяДата()));
	СписокСегментацияКлиентовПоМенеджерам.Параметры.УстановитьЗначениеПараметра("ДатаНачалаПотенциальные",
		ДатаНачалаПотенциальные);
	СписокСегментацияКлиентовПоМенеджерам.Параметры.УстановитьЗначениеПараметра("ДатаОкончанияПотенциальные",
		ДатаОкончанияПотенциальные);
		// Комлев АА 02/11/24 ---
КонецПроцедуры

&НаСервере
Процедура РассчитатьИтогиСписокСегментацияКлиентовПоМенеджерам() 
	// Комлев АА 02/11/24 +++
	СКД = Элементы.СписокСегментацияКлиентовПоМенеджерам.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	НастройкиКД = Элементы.СписокСегментацияКлиентовПоМенеджерам.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	КомпоновщикКД = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКД = КомпоновщикКД.Выполнить(СКД, НастройкиКД, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	ПроцессорКД = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКД.Инициализировать(МакетКД);
	ПроцессорВыводаКД = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	РезультатКД_ТЗ = ПроцессорВыводаКД.Вывести(ПроцессорКД);
	Элементы.СписокСегментацияКлиентовПоМенеджерамКоличествоГорячих.ТекстПодвала =  РезультатКД_ТЗ.Итог(
		"КоличествоГорячих");
	Элементы.СписокСегментацияКлиентовПоМенеджерамКоличествоАктивных.ТекстПодвала =  РезультатКД_ТЗ.Итог(
		"КоличествоАктивных");
	Элементы.СписокСегментацияКлиентовПоМенеджерамКоличествоТеплых.ТекстПодвала =  РезультатКД_ТЗ.Итог(
		"КоличествоТеплых");
	Элементы.СписокСегментацияКлиентовПоМенеджерамКоличествоПотенциальных.ТекстПодвала =  РезультатКД_ТЗ.Итог(
		"КоличествоПотенциальных");
	Элементы.СписокСегментацияКлиентовПоМенеджерамКоличествоХолодных.ТекстПодвала =  РезультатКД_ТЗ.Итог(
		"КоличествоХолодных");
	Элементы.СписокСегментацияКлиентовПоМенеджерамКоличествоДолжников.ТекстПодвала =  РезультатКД_ТЗ.Итог(
		"КоличествоДолжников");
	Элементы.СписокСегментацияКлиентовПоМенеджерамКоличествоНеЦелевых.ТекстПодвала =  РезультатКД_ТЗ.Итог(
		"КоличествоНеЦелевых");
	//Элементы.СписокСегментацияКлиентовПоМенеджерамИтогоПоМенеджеру.ТекстПодвала =  РезультатКД_ТЗ.Итог(
		//"ИтогоПоМенеджеру");
		
// Комлев АА 02/11/24 ---
КонецПроцедуры

Процедура ТекстЗапросаКоличествоКлиентов()
	Текст = "ВЫБРАТЬ
	|	Пользователи.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_Пользователи
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПродажаЗапчастей.Клиент) КАК КоличествоГорячих,
	|	ВЫБОР
	|		КОГДА ПродажаЗапчастей.Клиент.Ответственный <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|			ТОГДА ПродажаЗапчастей.Клиент.Ответственный
	|		ИНАЧЕ &ОбщийКлиент
	|	КОНЕЦ КАК Ответственный
	|ПОМЕСТИТЬ ГорячиеКлиентыПоМенеджерам
	|ИЗ
	|	Документ.ПродажаЗапчастей КАК ПродажаЗапчастей
	|ГДЕ
	|	(ПродажаЗапчастей.ЕстьДоставка
	|	И (ПродажаЗапчастей.ДатаПолучения МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|	ИЛИ ПродажаЗапчастей.Самовывоз
	|	И (ПродажаЗапчастей.ДатаОтгрузкиСоСклада МЕЖДУ &ДатаНачала И &ДатаОкончания))
	|	И ПродажаЗапчастей.Клиент.Целевой
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ПродажаЗапчастей.Клиент.Ответственный <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|			ТОГДА ПродажаЗапчастей.Клиент.Ответственный
	|		ИНАЧЕ &ОбщийКлиент
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказКлиента.Клиент КАК Клиент,
	|	ЗаказКлиента.Клиент.Ответственный КАК Ответственный
	|ПОМЕСТИТЬ АКБ
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ЗаказКлиента.Дата МЕЖДУ &ДатаНачалаАКБ И &ДатаОкончанияАКБ
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиента.Клиент,
	|	ЗаказКлиента.Клиент.Ответственный
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(ЗаказКлиента.Клиент) > 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ АКБ.Клиент) КАК КоличествоАктивных,
	|	ВЫБОР
	|		КОГДА АКБ.Ответственный <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|			ТОГДА АКБ.Ответственный
	|		ИНАЧЕ &ОбщийКлиент
	|	КОНЕЦ КАК Ответственный
	|ПОМЕСТИТЬ АктивныеКлиентыПоМенеджерам
	|ИЗ
	|	АКБ КАК АКБ
	|ГДЕ
	|	АКБ.Клиент.Целевой
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА АКБ.Ответственный <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|			ТОГДА АКБ.Ответственный
	|		ИНАЧЕ &ОбщийКлиент
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказКлиента.Клиент КАК Клиент,
	|	ЗаказКлиента.Клиент.Ответственный КАК Ответственный
	|ПОМЕСТИТЬ ТЕПЛЫЕ
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ЗаказКлиента.Дата МЕЖДУ &ДатаНачалаТеплые И &ДатаОкончанияТеплые
	|	И НЕ ЗаказКлиента.Клиент В
	|		(ВЫБРАТЬ
	|			АКБ.Клиент
	|		ИЗ
	|			АКБ КАК АКБ)
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиента.Клиент,
	|	ЗаказКлиента.Клиент.Ответственный
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(ЗаказКлиента.Клиент) > 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТЕПЛЫЕ.Клиент) КАК КоличествоТеплых,
	|	ВЫБОР
	|		КОГДА ТЕПЛЫЕ.Ответственный <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|			ТОГДА ТЕПЛЫЕ.Ответственный
	|		ИНАЧЕ &ОбщийКлиент
	|	КОНЕЦ КАК Ответственный
	|ПОМЕСТИТЬ ТеплыеКлиентыПоменеджерам
	|ИЗ
	|	ТЕПЛЫЕ КАК ТЕПЛЫЕ
	|ГДЕ
	|	ТЕПЛЫЕ.Клиент.Целевой
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ТЕПЛЫЕ.Ответственный <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|			ТОГДА ТЕПЛЫЕ.Ответственный
	|		ИНАЧЕ &ОбщийКлиент
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказКлиента.Клиент КАК Клиент,
	|	ЗаказКлиента.Клиент.Ответственный КАК Ответственный
	|ПОМЕСТИТЬ ПОТЕНЦ
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ЗаказКлиента.Дата МЕЖДУ &ДатаНачалаПотенциальные И &ДатаОкончанияПотенциальные
	|	И НЕ ЗаказКлиента.Клиент В
	|		(ВЫБРАТЬ
	|			АКБ.Клиент
	|		ИЗ
	|			АКБ КАК АКБ)
	|	И НЕ ЗаказКлиента.Клиент В
	|		(ВЫБРАТЬ
	|			ТЕПЛЫЕ.Клиент
	|		ИЗ
	|			ТЕПЛЫЕ КАК ТЕПЛЫЕ)
	|	И ЗаказКлиента.Клиент.Целевой
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиента.Клиент,
	|	ЗаказКлиента.Клиент.Ответственный
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(ЗаказКлиента.Клиент) = 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПОТЕНЦ.Клиент) КАК КоличествоПотенциальных,
	|	ВЫБОР
	|		КОГДА ПОТЕНЦ.Ответственный <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|			ТОГДА ПОТЕНЦ.Ответственный
	|		ИНАЧЕ &ОбщийКлиент
	|	КОНЕЦ КАК Ответственный
	|ПОМЕСТИТЬ ПотенциальныеКлиентыПоМенеджерам
	|ИЗ
	|	ПОТЕНЦ КАК ПОТЕНЦ
	|ГДЕ
	|	ПОТЕНЦ.Клиент.Целевой
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ПОТЕНЦ.Ответственный <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|			ТОГДА ПОТЕНЦ.Ответственный
	|		ИНАЧЕ &ОбщийКлиент
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Клиенты.Ссылка КАК Клиент,
	|	Клиенты.Ответственный КАК Ответственный
	|ПОМЕСТИТЬ ХолодныеКлиенты
	|ИЗ
	|	Справочник.Клиенты КАК Клиенты
	|ГДЕ
	|	НЕ Клиенты.Ссылка В
	|		(ВЫБРАТЬ
	|			АКБ.Клиент
	|		ИЗ
	|			АКБ КАК АКБ)
	|	И НЕ Клиенты.Ссылка В
	|		(ВЫБРАТЬ
	|			ТЕПЛЫЕ.Клиент
	|		ИЗ
	|			ТЕПЛЫЕ КАК ТЕПЛЫЕ)
	|	И НЕ Клиенты.Ссылка В
	|		(ВЫБРАТЬ
	|			ПОТЕНЦ.Клиент
	|		ИЗ
	|			ПОТЕНЦ КАК ПОТЕНЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ХолодныеКлиенты.Клиент) КАК КоличествоХолодных,
	|	ВЫБОР
	|		КОГДА ХолодныеКлиенты.Ответственный <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|			ТОГДА ХолодныеКлиенты.Ответственный
	|		ИНАЧЕ &ОбщийКлиент
	|	КОНЕЦ КАК Ответственный
	|ПОМЕСТИТЬ ХолодныеКлиентыПоМенеджерам
	|ИЗ
	|	ХолодныеКлиенты КАК ХолодныеКлиенты
	|ГДЕ
	|	ХолодныеКлиенты.Клиент.Целевой
	|	И НЕ ХолодныеКлиенты.Клиент В
	|		(ВЫБРАТЬ
	|			АКБ.Клиент
	|		ИЗ
	|			АКБ КАК АКБ)
	|	И НЕ ХолодныеКлиенты.Клиент В
	|		(ВЫБРАТЬ
	|			ТЕПЛЫЕ.Клиент
	|		ИЗ
	|			ТЕПЛЫЕ КАК ТЕПЛЫЕ)
	|	И НЕ ХолодныеКлиенты.Клиент В
	|		(ВЫБРАТЬ
	|			ПОТЕНЦ.Клиент
	|		ИЗ
	|			ПОТЕНЦ КАК ПОТЕНЦ)
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ХолодныеКлиенты.Ответственный <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|			ТОГДА ХолодныеКлиенты.Ответственный
	|		ИНАЧЕ &ОбщийКлиент
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПродажаЗапчастей.Клиент КАК Клиент,
	|	СУММА(ПродажаЗапчастей.ИтогоРекв) КАК СуммаПродажи
	|ПОМЕСТИТЬ ВТ_ДеньгиСПродажПоКлиентам
	|ИЗ
	|	Документ.ПродажаЗапчастей КАК ПродажаЗапчастей
	|ГДЕ
	|	НЕ ПродажаЗапчастей.ДолгСписан
	|СГРУППИРОВАТЬ ПО
	|	ПродажаЗапчастей.Клиент
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ЗаказНаряд.Клиент,
	|	ЗаказНаряд.СуммаДокумента
	|ИЗ
	|	Документ.ЗаказНаряд КАК ЗаказНаряд
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПриходДенегНаСчет.Сделка.Клиент КАК Клиент,
	|	СУММА(ПриходДенегНаСчет.СуммаДокумента) КАК СуммаПрихода
	|ПОМЕСТИТЬ ВТ_ПриходДенегПоКлиентам
	|ИЗ
	|	Документ.ПриходДенегНаСчет КАК ПриходДенегНаСчет
	|СГРУППИРОВАТЬ ПО
	|	ПриходДенегНаСчет.Сделка.Клиент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДеньгиСПродажПоКлиентам.Клиент КАК Клиент,
	|	ВТ_ДеньгиСПродажПоКлиентам.СуммаПродажи - ВТ_ПриходДенегПоКлиентам.СуммаПрихода КАК Долг
	|ПОМЕСТИТЬ Долги
	|ИЗ
	|	ВТ_ДеньгиСПродажПоКлиентам КАК ВТ_ДеньгиСПродажПоКлиентам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПриходДенегПоКлиентам КАК ВТ_ПриходДенегПоКлиентам
	|		ПО ВТ_ДеньгиСПродажПоКлиентам.Клиент = ВТ_ПриходДенегПоКлиентам.Клиент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Долги.Клиент) КАК КоличествоДолжников,
	|	ВЫБОР
	|		КОГДА Долги.Клиент.Ответственный <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|			ТОГДА Долги.Клиент.Ответственный
	|		ИНАЧЕ &ОбщийКлиент
	|	КОНЕЦ КАК Ответственный
	|ПОМЕСТИТЬ ДолжникиПоМенеджерам
	|ИЗ
	|	Долги КАК Долги
	|ГДЕ
	|	Долги.Долг > 0
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА Долги.Клиент.Ответственный <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|			ТОГДА Долги.Клиент.Ответственный
	|		ИНАЧЕ &ОбщийКлиент
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Клиенты.Ссылка) КАК КоличествоНеЦелевых,
	|	ВЫБОР
	|		КОГДА Клиенты.Ответственный <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|			ТОГДА Клиенты.Ответственный
	|		ИНАЧЕ &ОбщийКлиент
	|	КОНЕЦ КАК Ответственный
	|ПОМЕСТИТЬ НеЦелевыеКлиентыПоМенеджерам
	|ИЗ
	|	Справочник.Клиенты КАК Клиенты
	|ГДЕ
	|	НЕ Клиенты.Целевой
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА Клиенты.Ответственный <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|			ТОГДА Клиенты.Ответственный
	|		ИНАЧЕ &ОбщийКлиент
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Пользователи.Ссылка КАК Менеджер,
	|	ГорячиеКлиентыПоМенеджерам.КоличествоГорячих КАК КоличествоГорячих,
	|	АктивныеКлиентыПоМенеджерам.КоличествоАктивных КАК КоличествоАктивных,
	|	ТеплыеКлиентыПоменеджерам.КоличествоТеплых КАК КоличествоТеплых,
	|	ПотенциальныеКлиентыПоМенеджерам.КоличествоПотенциальных КАК КоличествоПотенциальных,
	|	ХолодныеКлиентыПоМенеджерам.КоличествоХолодных КАК КоличествоХолодных,
	|	ДолжникиПоМенеджерам.КоличествоДолжников КАК КоличествоДолжников,
	|	НеЦелевыеКлиентыПоМенеджерам.КоличествоНеЦелевых КАК КоличествоНеЦелевых,
	|	ЕСТЬNULL(ГорячиеКлиентыПоМенеджерам.КоличествоГорячих, 0) + ЕСТЬNULL(АктивныеКлиентыПоМенеджерам.КоличествоАктивных,
	|		0) + ЕСТЬNULL(ТеплыеКлиентыПоменеджерам.КоличествоТеплых, 0) +
	|		ЕСТЬNULL(ПотенциальныеКлиентыПоМенеджерам.КоличествоПотенциальных, 0) +
	|		ЕСТЬNULL(ХолодныеКлиентыПоМенеджерам.КоличествоХолодных, 0) + ЕСТЬNULL(ДолжникиПоМенеджерам.КоличествоДолжников, 0)
	|		+ ЕСТЬNULL(НеЦелевыеКлиентыПоМенеджерам.КоличествоНеЦелевых, 0) КАК ИтогоПоМенеджеру
	|ПОМЕСТИТЬ ВсеПользователи
	|ИЗ
	|	ВТ_Пользователи КАК ВТ_Пользователи
	|		ЛЕВОЕ СОЕДИНЕНИЕ ГорячиеКлиентыПоМенеджерам КАК ГорячиеКлиентыПоМенеджерам
	|		ПО (ГорячиеКлиентыПоМенеджерам.Ответственный = ВТ_Пользователи.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ АктивныеКлиентыПоМенеджерам КАК АктивныеКлиентыПоМенеджерам
	|		ПО (АктивныеКлиентыПоМенеджерам.Ответственный = ВТ_Пользователи.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТеплыеКлиентыПоменеджерам КАК ТеплыеКлиентыПоменеджерам
	|		ПО (ТеплыеКлиентыПоменеджерам.Ответственный = ВТ_Пользователи.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПотенциальныеКлиентыПоМенеджерам КАК ПотенциальныеКлиентыПоМенеджерам
	|		ПО (ПотенциальныеКлиентыПоМенеджерам.Ответственный = ВТ_Пользователи.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ХолодныеКлиентыПоМенеджерам КАК ХолодныеКлиентыПоМенеджерам
	|		ПО (ХолодныеКлиентыПоМенеджерам.Ответственный = ВТ_Пользователи.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДолжникиПоМенеджерам КАК ДолжникиПоМенеджерам
	|		ПО (ДолжникиПоМенеджерам.Ответственный = ВТ_Пользователи.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ НеЦелевыеКлиентыПоМенеджерам КАК НеЦелевыеКлиентыПоМенеджерам
	|		ПО (НеЦелевыеКлиентыПоМенеджерам.Ответственный = ВТ_Пользователи.Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеПользователи.Менеджер КАК Менеджер,
	|	ВсеПользователи.КоличествоГорячих КАК КоличествоГорячих,
	|	ВсеПользователи.КоличествоАктивных КАК КоличествоАктивных,
	|	ВсеПользователи.КоличествоТеплых КАК КоличествоТеплых,
	|	ВсеПользователи.КоличествоПотенциальных КАК КоличествоПотенциальных,
	|	ВсеПользователи.КоличествоХолодных КАК КоличествоХолодных,
	|	ВсеПользователи.КоличествоДолжников КАК КоличествоДолжников,
	|	ВсеПользователи.КоличествоНеЦелевых КАК КоличествоНеЦелевых,
	|	ВсеПользователи.ИтогоПоМенеджеру КАК ИтогоПоМенеджеру
	|ИЗ
	|	ВсеПользователи КАК ВсеПользователи
	|ГДЕ
	|	(ВсеПользователи.КоличествоГорячих <> 0
	|	ИЛИ ВсеПользователи.КоличествоАктивных <> 0
	|	ИЛИ ВсеПользователи.КоличествоТеплых <> 0
	|	ИЛИ ВсеПользователи.КоличествоПотенциальных <> 0
	|	ИЛИ ВсеПользователи.КоличествоХолодных <> 0
	|	ИЛИ ВсеПользователи.КоличествоДолжников <> 0
	|	ИЛИ ВсеПользователи.КоличествоНеЦелевых <> 0)";
	
	
	СписокСегментацияКлиентовПоМенеджерам.ПроизвольныйЗапрос = Истина;
	СписокСегментацияКлиентовПоМенеджерам.ТекстЗапроса = Текст;
	
КонецПроцедуры

Процедура ТекстЗапросаКоличествоМашин()
	Текст = "ВЫБРАТЬ
	|	Пользователи.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_Пользователи
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ПродажаЗапчастей.Клиент.Ответственный <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|			ТОГДА ПродажаЗапчастей.Клиент.Ответственный
	|		ИНАЧЕ &ОбщийКлиент
	|	КОНЕЦ КАК Ответственный,
	|	СУММА(ПродажаЗапчастей.Клиент.КоличествоАвтомобилей) КАК КоличествоГорячих
	|ПОМЕСТИТЬ ГорячиеКлиентыПоМенеджерам
	|ИЗ
	|	Документ.ПродажаЗапчастей КАК ПродажаЗапчастей
	|ГДЕ
	|	(ПродажаЗапчастей.ЕстьДоставка
	|	И (ПродажаЗапчастей.ДатаПолучения МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|	ИЛИ ПродажаЗапчастей.Самовывоз
	|	И (ПродажаЗапчастей.ДатаОтгрузкиСоСклада МЕЖДУ &ДатаНачала И &ДатаОкончания))
	|	И ПродажаЗапчастей.Клиент.Целевой
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ПродажаЗапчастей.Клиент.Ответственный <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|			ТОГДА ПродажаЗапчастей.Клиент.Ответственный
	|		ИНАЧЕ &ОбщийКлиент
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказКлиента.Клиент КАК Клиент,
	|	ЗаказКлиента.Клиент.Ответственный КАК Ответственный,
	|	ЗаказКлиента.Клиент.КоличествоАвтомобилей КАК КоличествоАвтомобилей
	|ПОМЕСТИТЬ АКБ
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ЗаказКлиента.Дата МЕЖДУ &ДатаНачалаАКБ И &ДатаОкончанияАКБ
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиента.Клиент,
	|	ЗаказКлиента.Клиент.Ответственный,
	|	ЗаказКлиента.Клиент.КоличествоАвтомобилей
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(ЗаказКлиента.Клиент) > 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА АКБ.Ответственный <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|			ТОГДА АКБ.Ответственный
	|		ИНАЧЕ &ОбщийКлиент
	|	КОНЕЦ КАК Ответственный,
	|	СУММА(АКБ.КоличествоАвтомобилей) КАК КоличествоАктивных
	|ПОМЕСТИТЬ АктивныеКлиентыПоМенеджерам
	|ИЗ
	|	АКБ КАК АКБ
	|ГДЕ
	|	АКБ.Клиент.Целевой
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА АКБ.Ответственный <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|			ТОГДА АКБ.Ответственный
	|		ИНАЧЕ &ОбщийКлиент
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказКлиента.Клиент КАК Клиент,
	|	ЗаказКлиента.Клиент.Ответственный КАК Ответственный,
	|	ЗаказКлиента.Клиент.КоличествоАвтомобилей КАК КлиентКоличествоАвтомобилей
	|ПОМЕСТИТЬ ТЕПЛЫЕ
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ЗаказКлиента.Дата МЕЖДУ &ДатаНачалаТеплые И &ДатаОкончанияТеплые
	|	И НЕ ЗаказКлиента.Клиент В
	|		(ВЫБРАТЬ
	|			АКБ.Клиент
	|		ИЗ
	|			АКБ КАК АКБ)
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиента.Клиент,
	|	ЗаказКлиента.Клиент.Ответственный,
	|	ЗаказКлиента.Клиент.КоличествоАвтомобилей
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(ЗаказКлиента.Клиент) > 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ТЕПЛЫЕ.Ответственный <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|			ТОГДА ТЕПЛЫЕ.Ответственный
	|		ИНАЧЕ &ОбщийКлиент
	|	КОНЕЦ КАК Ответственный,
	|	СУММА(ТЕПЛЫЕ.КлиентКоличествоАвтомобилей) КАК КоличествоТеплых
	|ПОМЕСТИТЬ ТеплыеКлиентыПоменеджерам
	|ИЗ
	|	ТЕПЛЫЕ КАК ТЕПЛЫЕ
	|ГДЕ
	|	ТЕПЛЫЕ.Клиент.Целевой
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ТЕПЛЫЕ.Ответственный <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|			ТОГДА ТЕПЛЫЕ.Ответственный
	|		ИНАЧЕ &ОбщийКлиент
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказКлиента.Клиент КАК Клиент,
	|	ЗаказКлиента.Клиент.Ответственный КАК Ответственный,
	|	ЗаказКлиента.Клиент.КоличествоАвтомобилей КАК КлиентКоличествоАвтомобилей
	|ПОМЕСТИТЬ ПОТЕНЦ
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ЗаказКлиента.Дата МЕЖДУ &ДатаНачалаПотенциальные И &ДатаОкончанияПотенциальные
	|	И НЕ ЗаказКлиента.Клиент В
	|		(ВЫБРАТЬ
	|			АКБ.Клиент
	|		ИЗ
	|			АКБ КАК АКБ)
	|	И НЕ ЗаказКлиента.Клиент В
	|		(ВЫБРАТЬ
	|			ТЕПЛЫЕ.Клиент
	|		ИЗ
	|			ТЕПЛЫЕ КАК ТЕПЛЫЕ)
	|	И ЗаказКлиента.Клиент.Целевой
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиента.Клиент,
	|	ЗаказКлиента.Клиент.Ответственный,
	|	ЗаказКлиента.Клиент.КоличествоАвтомобилей
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(ЗаказКлиента.Клиент) = 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ПОТЕНЦ.Ответственный <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|			ТОГДА ПОТЕНЦ.Ответственный
	|		ИНАЧЕ &ОбщийКлиент
	|	КОНЕЦ КАК Ответственный,
	|	СУММА(ПОТЕНЦ.КлиентКоличествоАвтомобилей) КАК КоличествоПотенциальных
	|ПОМЕСТИТЬ ПотенциальныеКлиентыПоМенеджерам
	|ИЗ
	|	ПОТЕНЦ КАК ПОТЕНЦ
	|ГДЕ
	|	ПОТЕНЦ.Клиент.Целевой
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ПОТЕНЦ.Ответственный <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|			ТОГДА ПОТЕНЦ.Ответственный
	|		ИНАЧЕ &ОбщийКлиент
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Клиенты.Ссылка КАК Клиент,
	|	Клиенты.Ответственный КАК Ответственный,
	|	Клиенты.КоличествоАвтомобилей КАК КоличествоАвтомобилей
	|ПОМЕСТИТЬ ХолодныеКлиенты
	|ИЗ
	|	Справочник.Клиенты КАК Клиенты
	|ГДЕ
	|	НЕ Клиенты.Ссылка В
	|		(ВЫБРАТЬ
	|			АКБ.Клиент
	|		ИЗ
	|			АКБ КАК АКБ)
	|	И НЕ Клиенты.Ссылка В
	|		(ВЫБРАТЬ
	|			ТЕПЛЫЕ.Клиент
	|		ИЗ
	|			ТЕПЛЫЕ КАК ТЕПЛЫЕ)
	|	И НЕ Клиенты.Ссылка В
	|		(ВЫБРАТЬ
	|			ПОТЕНЦ.Клиент
	|		ИЗ
	|			ПОТЕНЦ КАК ПОТЕНЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ХолодныеКлиенты.Ответственный <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|			ТОГДА ХолодныеКлиенты.Ответственный
	|		ИНАЧЕ &ОбщийКлиент
	|	КОНЕЦ КАК Ответственный,
	|	СУММА(ХолодныеКлиенты.КоличествоАвтомобилей) КАК КоличествоХолодных
	|ПОМЕСТИТЬ ХолодныеКлиентыПоМенеджерам
	|ИЗ
	|	ХолодныеКлиенты КАК ХолодныеКлиенты
	|ГДЕ
	|	ХолодныеКлиенты.Клиент.Целевой
	|	И НЕ ХолодныеКлиенты.Клиент В
	|		(ВЫБРАТЬ
	|			АКБ.Клиент
	|		ИЗ
	|			АКБ КАК АКБ)
	|	И НЕ ХолодныеКлиенты.Клиент В
	|		(ВЫБРАТЬ
	|			ТЕПЛЫЕ.Клиент
	|		ИЗ
	|			ТЕПЛЫЕ КАК ТЕПЛЫЕ)
	|	И НЕ ХолодныеКлиенты.Клиент В
	|		(ВЫБРАТЬ
	|			ПОТЕНЦ.Клиент
	|		ИЗ
	|			ПОТЕНЦ КАК ПОТЕНЦ)
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ХолодныеКлиенты.Ответственный <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|			ТОГДА ХолодныеКлиенты.Ответственный
	|		ИНАЧЕ &ОбщийКлиент
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПродажаЗапчастей.Клиент КАК Клиент,
	|	СУММА(ПродажаЗапчастей.ИтогоРекв) КАК СуммаПродажи
	|ПОМЕСТИТЬ ВТ_ДеньгиСПродажПоКлиентам
	|ИЗ
	|	Документ.ПродажаЗапчастей КАК ПродажаЗапчастей
	|ГДЕ
	|	НЕ ПродажаЗапчастей.ДолгСписан
	|СГРУППИРОВАТЬ ПО
	|	ПродажаЗапчастей.Клиент
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ЗаказНаряд.Клиент,
	|	ЗаказНаряд.СуммаДокумента
	|ИЗ
	|	Документ.ЗаказНаряд КАК ЗаказНаряд
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПриходДенегНаСчет.Сделка.Клиент КАК Клиент,
	|	СУММА(ПриходДенегНаСчет.СуммаДокумента) КАК СуммаПрихода
	|ПОМЕСТИТЬ ВТ_ПриходДенегПоКлиентам
	|ИЗ
	|	Документ.ПриходДенегНаСчет КАК ПриходДенегНаСчет
	|СГРУППИРОВАТЬ ПО
	|	ПриходДенегНаСчет.Сделка.Клиент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДеньгиСПродажПоКлиентам.Клиент КАК Клиент,
	|	ВТ_ДеньгиСПродажПоКлиентам.СуммаПродажи - ВТ_ПриходДенегПоКлиентам.СуммаПрихода КАК Долг
	|ПОМЕСТИТЬ Долги
	|ИЗ
	|	ВТ_ДеньгиСПродажПоКлиентам КАК ВТ_ДеньгиСПродажПоКлиентам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПриходДенегПоКлиентам КАК ВТ_ПриходДенегПоКлиентам
	|		ПО ВТ_ДеньгиСПродажПоКлиентам.Клиент = ВТ_ПриходДенегПоКлиентам.Клиент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(Долги.Клиент.КоличествоАвтомобилей) КАК КоличествоДолжников,
	|	ВЫБОР
	|		КОГДА Долги.Клиент.Ответственный <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|			ТОГДА Долги.Клиент.Ответственный
	|		ИНАЧЕ &ОбщийКлиент
	|	КОНЕЦ КАК Ответственный
	|ПОМЕСТИТЬ ДолжникиПоМенеджерам
	|ИЗ
	|	Долги КАК Долги
	|ГДЕ
	|	Долги.Долг > 0
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА Долги.Клиент.Ответственный <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|			ТОГДА Долги.Клиент.Ответственный
	|		ИНАЧЕ &ОбщийКлиент
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Сумма(Клиенты.КоличествоАвтомобилей) КАК КоличествоНеЦелевых,
	|	ВЫБОР
	|		КОГДА Клиенты.Ответственный <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|			ТОГДА Клиенты.Ответственный
	|		ИНАЧЕ &ОбщийКлиент
	|	КОНЕЦ КАК Ответственный
	|ПОМЕСТИТЬ НеЦелевыеКлиентыПоМенеджерам
	|ИЗ
	|	Справочник.Клиенты КАК Клиенты
	|ГДЕ
	|	НЕ Клиенты.Целевой
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА Клиенты.Ответственный <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|			ТОГДА Клиенты.Ответственный
	|		ИНАЧЕ &ОбщийКлиент
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Пользователи.Ссылка КАК Менеджер,
	|	ДолжникиПоМенеджерам.КоличествоДолжников КАК КоличествоДолжников,
	|	НеЦелевыеКлиентыПоМенеджерам.КоличествоНеЦелевых КАК КоличествоНеЦелевых,
	|	ГорячиеКлиентыПоМенеджерам.КоличествоГорячих КАК КоличествоГорячих,
	|	АктивныеКлиентыПоМенеджерам.КоличествоАктивных КАК КоличествоАктивных,
	|	ТеплыеКлиентыПоменеджерам.КоличествоТеплых КАК КоличествоТеплых,
	|	ПотенциальныеКлиентыПоМенеджерам.КоличествоПотенциальных КАК КоличествоПотенциальных,
	|	ХолодныеКлиентыПоМенеджерам.КоличествоХолодных КАК КоличествоХолодных,
	|	ЕСТЬNULL(ГорячиеКлиентыПоМенеджерам.КоличествоГорячих, 0) + ЕСТЬNULL(АктивныеКлиентыПоМенеджерам.КоличествоАктивных,
	|		0) + ЕСТЬNULL(ТеплыеКлиентыПоменеджерам.КоличествоТеплых, 0) +
	|		ЕСТЬNULL(ПотенциальныеКлиентыПоМенеджерам.КоличествоПотенциальных, 0) +
	|		ЕСТЬNULL(ХолодныеКлиентыПоМенеджерам.КоличествоХолодных, 0) + ЕСТЬNULL(ДолжникиПоМенеджерам.КоличествоДолжников, 0)
	|		+ ЕСТЬNULL(НеЦелевыеКлиентыПоМенеджерам.КоличествоНеЦелевых, 0) КАК ИтогоПоМенеджеру
	|ПОМЕСТИТЬ ВсеПользователи
	|ИЗ
	|	ВТ_Пользователи КАК ВТ_Пользователи
	|		ЛЕВОЕ СОЕДИНЕНИЕ ГорячиеКлиентыПоМенеджерам КАК ГорячиеКлиентыПоМенеджерам
	|		ПО (ГорячиеКлиентыПоМенеджерам.Ответственный = ВТ_Пользователи.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТеплыеКлиентыПоменеджерам КАК ТеплыеКлиентыПоменеджерам
	|		ПО (ТеплыеКлиентыПоменеджерам.Ответственный = ВТ_Пользователи.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПотенциальныеКлиентыПоМенеджерам КАК ПотенциальныеКлиентыПоМенеджерам
	|		ПО (ПотенциальныеКлиентыПоМенеджерам.Ответственный = ВТ_Пользователи.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ХолодныеКлиентыПоМенеджерам КАК ХолодныеКлиентыПоМенеджерам
	|		ПО (ХолодныеКлиентыПоМенеджерам.Ответственный = ВТ_Пользователи.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДолжникиПоМенеджерам КАК ДолжникиПоМенеджерам
	|		ПО (ДолжникиПоМенеджерам.Ответственный = ВТ_Пользователи.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ НеЦелевыеКлиентыПоМенеджерам КАК НеЦелевыеКлиентыПоМенеджерам
	|		ПО (НеЦелевыеКлиентыПоМенеджерам.Ответственный = ВТ_Пользователи.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ АктивныеКлиентыПоМенеджерам КАК АктивныеКлиентыПоМенеджерам
	|		ПО ВТ_Пользователи.Ссылка = АктивныеКлиентыПоМенеджерам.Ответственный
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеПользователи.Менеджер КАК Менеджер,
	|	ВсеПользователи.КоличествоГорячих КАК КоличествоГорячих,
	|	ВсеПользователи.КоличествоАктивных КАК КоличествоАктивных,
	|	ВсеПользователи.КоличествоТеплых КАК КоличествоТеплых,
	|	ВсеПользователи.КоличествоПотенциальных КАК КоличествоПотенциальных,
	|	ВсеПользователи.КоличествоХолодных КАК КоличествоХолодных,
	|	ВсеПользователи.КоличествоДолжников КАК КоличествоДолжников,
	|	ВсеПользователи.КоличествоНеЦелевых КАК КоличествоНеЦелевых,
	|	ВсеПользователи.ИтогоПоМенеджеру
	|ИЗ
	|	ВсеПользователи КАК ВсеПользователи
	|ГДЕ
	|	(ВсеПользователи.КоличествоГорячих <> 0
	|	ИЛИ ВсеПользователи.КоличествоАктивных <> 0
	|	ИЛИ ВсеПользователи.КоличествоТеплых <> 0
	|	ИЛИ ВсеПользователи.КоличествоПотенциальных <> 0
	|	ИЛИ ВсеПользователи.КоличествоХолодных <> 0
	|	ИЛИ ВсеПользователи.КоличествоДолжников <> 0
	|	ИЛИ ВсеПользователи.КоличествоНеЦелевых <> 0)";
	
	СписокСегментацияКлиентовПоМенеджерам.ПроизвольныйЗапрос = Истина;
	СписокСегментацияКлиентовПоМенеджерам.ТекстЗапроса = Текст;

КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ФильтрПриИзменении(Элемент)
	Если Фильтр = 1 Тогда
		ТекстЗапросаКоличествоКлиентов();;
	Иначе
		ТекстЗапросаКоличествоМашин();
	КонецЕсли;
	ЗаполнитьПараметрыСписокСегментацияКлиентовПоМенеджерам();
	Элементы.СписокСегментацияКлиентовПоМенеджерам.Обновить();
	РассчитатьИтогиСписокСегментацияКлиентовПоМенеджерам();
	//ОбновитьОтображениеДанных();
	 
КонецПроцедуры



#КонецОбласти
